СуточноМесячныйГрафик/src/Documents/ПланВыполненияПоВсемуПроекту/ПланВыполненияПоВсемуПроекту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланВыполненияПоВсемуПроекту</name>
  <registerRecords>AccumulationRegister.ПланПоВсемуПроекту</registerRecords>
  <registerRecords>InformationRegister.ДатаИзмененияПланаПоПроекту</registerRecords>
  <tabularSections>
    <name>Выполнение</name>
    <attributes>
      <name>Подрядчик</name>
      <type>
        <types>CatalogRef.СправочникПодрядчиков</types>
      </type>
    </attributes>
    <attributes>
      <name>Титул</name>
      <type>
        <types>CatalogRef.СправочникТитулов</types>
      </type>
    </attributes>
    <attributes>
      <name>ШифрПроекта</name>
      <type>
        <types>CatalogRef.ШифрыПроекта</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЛокальнойСметы</name>
      <type>
        <types>CatalogRef.ЛокальныеСметы</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеСМР</name>
      <type>
        <types>CatalogRef.СправочникСМР</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдИзм</types>
      </type>
    </attributes>
    <attributes>
      <name>Объём</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

СуточноМесячныйГрафик/src/AccumulationRegisters/ПланПоВсемуПроекту/ПланПоВсемуПроекту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПланПоВсемуПроекту</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ПланОбъёмВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.СправочникПодрядчиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Титул</name>
    <type>
      <types>CatalogRef.СправочникТитулов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШифрПроекта</name>
    <type>
      <types>CatalogRef.ШифрыПроекта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛокальнаяСмета</name>
    <type>
      <types>CatalogRef.ЛокальныеСметы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СМР</name>
    <type>
      <types>CatalogRef.СправочникСМР</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдИзм</name>
    <type>
      <types>CatalogRef.ЕдИзм</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

СуточноМесячныйГрафик/src/InformationRegisters/ДатаИзмененияПланаПоПроекту/ДатаИзмененияПланаПоПроекту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатаИзмененияПланаПоПроекту</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаИзма</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.СправочникПодрядчиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Титул</name>
    <type>
      <types>CatalogRef.СправочникТитулов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШифрПроекта</name>
    <type>
      <types>CatalogRef.ШифрыПроекта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛокальнаяСмета</name>
    <type>
      <types>CatalogRef.ЛокальныеСметы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СМР</name>
    <type>
      <types>CatalogRef.СправочникСМР</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдИзм</name>
    <type>
      <types>CatalogRef.ЕдИзм</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

СуточноМесячныйГрафик/src/Documents/ПланВыполненияПоВсемуПроекту/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ПланПоВсемуПроекту.Записывать = Истина;
	Движения.ПланПоВсемуПроекту.Очистить();
	Для Каждого СтрокаТЧ Из Выполнение Цикл
		Движение = Движения.ПланПоВсемуПроекту.Добавить();
		Движение.Период = Дата;
		Движение.Подрядчик = СтрокаТЧ.Подрядчик;
		Движение.Титул = СтрокаТЧ.Титул;
		Движение.ШифрПроекта = СтрокаТЧ.ШифрПроекта;
		Движение.ЛокальнаяСмета = СтрокаТЧ.НомерЛокальнойСметы;
		Движение.СМР = СтрокаТЧ.НаименованиеСМР;
		Движение.ЕдИзм = СтрокаТЧ.ЕдиницаИзмерения;
		Движение.ПланОбъёмВыполнения = СтрокаТЧ.Объём;
	КонецЦикла;
	Движения.ДатаИзмененияПланаПоПроекту.Записывать = Истина;
	Движения.ДатаИзмененияПланаПоПроекту.Очистить();
	Движение = Движения.ДатаИзмененияПланаПоПроекту.Добавить();
	Движение.Период = Дата;
	Движение.Подрядчик = СтрокаТЧ.Подрядчик;
	Движение.Титул = СтрокаТЧ.Титул;
	Движение.ШифрПроекта = СтрокаТЧ.ШифрПроекта;
	Движение.ЛокальнаяСмета = СтрокаТЧ.НомерЛокальнойСметы;
	Движение.СМР = СтрокаТЧ.НаименованиеСМР;
	Движение.ЕдИзм = СтрокаТЧ.ЕдиницаИзмерения;
	Движение.ДатаИзма = Дата;
КонецПроцедуры
